In [6]:
# On sélectionne uniquement les colonnes stratégiques
# (Adapte les noms si tes colonnes s'appellent un peu différemment)
colonnes_utiles = [
    'work_year',
    'experience_level',
    'employment_type',
    'job_title',
    'salary_in_usd',
    'employee_residence',
    'remote_ratio',
    'company_location',
    'company_size'
]

df_clean = df[colonnes_utiles].copy()

# On renomme la colonne salaire pour que ce soit plus clair
df_clean = df_clean.rename(columns={'salary_in_usd': 'Salaire_USD'})

# Vérification
df_clean.head()

,work_year,experience_level,employment_type,job_title,Salaire_USD,employee_residence,remote_ratio,company_location,company_size
0,2025,MI,FT,Research Scientist,208000,US,0,US,M
1,2025,MI,FT,Research Scientist,147000,US,0,US,M
2,2025,SE,FT,Research Scientist,173000,US,0,US,M
3,2025,SE,FT,Research Scientist,117000,US,0,US,M
4,2025,MI,FT,AI Engineer,100000,US,100,US,M

In [4]:
# Affiche le Top 20 des métiers les plus fréquents dans ton fichier
df['job_title'].value_counts().head(20)

job_title
Data Scientist                    13848
Data Engineer                     11323
Software Engineer                 10133
Data Analyst                       9081
Machine Learning Engineer          6643
Engineer                           5804
Manager                            3832
Research Scientist                 2641
Analyst                            2314
Applied Scientist                  1816
Data Architect                     1557
Analytics Engineer                 1424
Product Manager                    1394
Associate                          1271
Research Engineer                  1249
AI Engineer                         936
Data Manager                        761
Business Intelligence Engineer      702
Machine Learning Researcher         669
Consultant                          657
Name: count, dtype: int64

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 93597 entries, 0 to 93596
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           93597 non-null  int64
 1   experience_level    93597 non-null  object
 2   employment_type     93597 non-null  object
 3   job_title           93597 non-null  object
 4   salary              93597 non-null  int64
 5   salary_currency     93597 non-null  object
 6   salary_in_usd       93597 non-null  int64
 7   employee_residence  93597 non-null  object
 8   remote_ratio        93597 non-null  int64
 9   company_location    93597 non-null  object
 10  company_size        93597 non-null  object
dtypes: int64(4), object(7)
memory usage: 7.9+ MB

In [2]:
import pandas as pd

# Chargement du fichier
# (Comme il est dans le même dossier, juste le nom suffit)
df = pd.read_csv('salaries.csv')

# Afficher les 5 premières lignes pour vérifier
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2025,MI,FT,Research Scientist,208000,USD,208000,US,0,US,M
1,2025,MI,FT,Research Scientist,147000,USD,147000,US,0,US,M
2,2025,SE,FT,Research Scientist,173000,USD,173000,US,0,US,M
3,2025,SE,FT,Research Scientist,117000,USD,117000,US,0,US,M
4,2025,MI,FT,AI Engineer,100000,USD,100000,US,100,US,M